In [6]:
import pandas as pd

### Series
A Series is a one-dimensional array with a single column that can hold heterogeneous data (integers, strings, floating-point numbers, Python objects, etc.).It has an index that can be used to call different data values.

Series function in its basic form only needs a list of data to be created.

pd.Series(data)

In [7]:
data = [2, 3, 4, 5]
series_1 = pd.Series(data)
series_1

0    2
1    3
2    4
3    5
dtype: int64

In [8]:
series_1 = pd.Series(data = data, name = 'Hours')
series_1

0    2
1    3
2    4
3    5
Name: Hours, dtype: int64

In [9]:
sale = pd.Series([500,85000,40000,9600,100000], index = ['Cookie', 'Choco', 'Toothpaste', 'Soap', 'Toffee'])
sale

Cookie           500
Choco          85000
Toothpaste     40000
Soap            9600
Toffee        100000
dtype: int64

### Data Frame
Data frame is a two-dimensional array. It can also be thought of as a two or more Series. It looks like a spreadsheet or tabular data with rows, columns and an index. It has two axes, axis 0 and 1. 0 always means rows, and 1 means columns.

The most straightforward way to create a data frame is with keys and corresponding lists from the dictionary. Index by default is numbers (0,1,2..n) unless index defines explicitly.

Let's create a dictionary first.

In [10]:
data = {'country': ['Canada', 'Canada', 'US', 'US', 'UK', 'UK'],
'year': [2010, 2011, 2012, 2013, 2014, 2015],
'pop': [2.5, 1.7, 2.6, 1.4, 4.9, 3.7]}
data

{'country': ['Canada', 'Canada', 'US', 'US', 'UK', 'UK'],
 'year': [2010, 2011, 2012, 2013, 2014, 2015],
 'pop': [2.5, 1.7, 2.6, 1.4, 4.9, 3.7]}

In [14]:
dataf = pd.DataFrame(data)

dataf

  country  year  pop
0  Canada  2010  2.5
1  Canada  2011  1.7
2      US  2012  2.6
3      US  2013  1.4
4      UK  2014  4.9
5      UK  2015  3.7

Reorder columns

In [15]:
pd.DataFrame(data, columns=['year', 'country', 'pop'])

   year country  pop
0  2010  Canada  2.5
1  2011  Canada  1.7
2  2012      US  2.6
3  2013      US  1.4
4  2014      UK  4.9
5  2015      UK  3.7

Add a column which doesn't exists

In [16]:
data = pd.DataFrame(data, columns= ['year', 'country', 'pop', 'uni'])
data

   year country  pop  uni
0  2010  Canada  2.5  NaN
1  2011  Canada  1.7  NaN
2  2012      US  2.6  NaN
3  2013      US  1.4  NaN
4  2014      UK  4.9  NaN
5  2015      UK  3.7  NaN